ТСД_файловая/src/DataProcessors/Логистика/Логистика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Логистика</name>
  <tabularSections>
    <name>Документы</name>
    <attributes>
      <name>ИД_ТТН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИД_УП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Маршрут</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкладСборки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>120</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТочкаДоставки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>120</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТЧ_Global_ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>сч_док</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>сч_скан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Короб</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерТУ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РК</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АдресаДоставки</name>
    <attributes>
      <name>ТЧ_Global_ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>120</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>сч_док</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>сч_скан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РК</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

ТСД_файловая/src/DataProcessors/Логистика/Forms/ФормаСортування/Module.bsl
&НаКлиенте
Перем ВыполняетсяЗакрытие;


	
	
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	ОбработкаФормыСервер.ПриСозданииНаСервере(ЭтотОбъект,Отказ,СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)  
	ВыполняетсяЗакрытие = Ложь;
	ОбработкаФормыКлиент.ПриОткрытии(ЭтотОбъект,Отказ);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ВыполняетсяЗакрытие Тогда
		ОбщегоНазначенияКлиентСервер.ОчиститьСотрудника();
	Иначе
		Отказ = Истина;
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение",ЭтотОбъект),"Закрити документ?",РежимДиалогаВопрос.ДаНет);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ПодключаемоеОборудованиеКлиент.ЭтоОповещениеСканераШтрихкода(ИмяСобытия) И ВводДоступен() Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
		ОбработатьПолученныйШтрихкод(Параметр, ДополнительныеПараметры);
		
	ИначеЕсли ИмяСобытия = "ИзмененоПодразделение" Тогда
		
		ОбновитьПодразделение();
		
	ИначеЕсли ИмяСобытия = "ИзмененСотрудник" Тогда
		
		ОбновитьСотрудника();
		
		Если ПользовательИнициализирован Тогда
			ПолучитьДанныеСортировки();
			 // ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Записать", "Видимость",Объект.Документы.Количество()>0);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры




&НаСервере
Процедура ОбновитьПодразделение()
	ОбработкаФормыСервер.ОбновитьПодразделение(ЭтотОбъект);	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСотрудника()
	ОбработкаФормыСервер.ОбновитьСотрудника(ЭтотОбъект);	
КонецПроцедуры
 
&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса,ДопоплнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ВыполняетсяЗакрытие = Истина;
		Закрыть();
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеЗакрытияВводаСотрудника(Результат,ДополнительныеПараметры)Экспорт 
	
КонецПроцедуры


  
&НаКлиенте
Процедура АдресаДоставкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)	
	СтандартнаяОбработка = Ложь;
	

	ТекущиеДанные = Элементы.АдресаДоставки.ТекущиеДанные;
	ОткрытьФорму("ОбщаяФорма.ФормаПечати",СформироватьСтруктуруДляПечатиНаСервере(ТекущиеДанные.ТЧ_Global_ID,ТекущиеДанные.ТД),ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	

	
КонецПроцедуры

 &НаСервере
Функция СформироватьСтруктуруДляПечатиНаСервере(ТЧ_Global_ID,ТочкаДоставки)
	
	МассивСтрок = Объект.Документы.НайтиСтроки(Новый Структура("ТЧ_Global_ID",ТЧ_Global_ID,));	 
	СтруктураСтрок = Новый Структура;
	СтруктураСтрок.Вставить("PKG");
	СтруктураСтрок.Вставить("ТочкаДоставки",ТочкаДоставки);
	МассивPKG = Новый Массив;
	Для Каждого ТекТаблицаPKG Из МассивСтрок Цикл 
		МассивPKG.Добавить(Новый Структура("СкладСборки,НомерТУ,сч_скан",ТекТаблицаPKG.СкладСборки,ТекТаблицаPKG.НомерТУ,ТекТаблицаPKG.сч_скан));
	КонецЦикла;
	СтруктураСтрок.Вставить("ДанныеPKG",МассивPKG);
	
	Возврат СтруктураСтрок;
	
КонецФункции



&НаКлиенте
Процедура АдресаДоставкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресаДоставкиПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	АдресаДоставкиВыбор(Элемент,,,);
КонецПроцедуры



&НаКлиенте
Процедура ОбработатьПолученныйШтрихкод(ПолученныйШтрихкод, Параметры) Экспорт
	
	Если ПустаяСтрока(ПолученныйШтрихкод) Тогда
		Возврат;
	КонецЕсли;
	
	
	Если НЕ ПользовательИнициализирован Тогда
		
		Результат	= ИнтеграцияТК_Клиент.ПолучитьСотрудника(ПолученныйШтрихкод);

		Если Результат.Результат Тогда
			Оповестить("ИзмененСотрудник");
		Иначе
			Сообщить("Необхідна авторизація користувача");
		КонецЕсли;
		
		Возврат;  
	КонецЕсли;
	
	Если СтрНачинаетсяС(ПолученныйШтрихкод,"RK;") Тогда 
		RKИнфо = ПолучитьДанныеRK(ПолученныйШтрихкод);
		Если RKИнфо.Результат Тогда
			СтруктураРК =  RKИнфо.Ответ;   
			СтруктураФормаРК = Новый Структура; 
			СтруктураФормаРК.Вставить("RK_ID",СтруктураРК.RK_ID);
			СтруктураФормаРК.Вставить("РК_Инф",СтруктураРК.RK_neme);

			СтруктураФормаРК.Вставить("АдресаДоставки",Объект.АдресаДоставки);

			Если СтруктураРК.Global_ID <> 0 Тогда
				СтрокиАдресаДоставки = Объект.АдресаДоставки.НайтиСтроки(Новый Структура("ТЧ_Global_ID",RKИнфо.Ответ.Global_ID));	
				Если СтрокиАдресаДоставки.Количество() = 0  Тогда
					Сообщить("В списке нет адреса доставки "+СтруктураРК.ТД);	
					Возврат;
				Иначе
					СтрокаАдрес = СтрокиАдресаДоставки[0];	
				//	СтрокаАдрес.сч_скан = СтруктураРК.сч_скан;
				//	СтрокаАдрес.ЗаписьПоСтроке = ?(СтрокаАдрес.РК,"ROLL CAGE ","")+"PKG "+ Формат(СтрокаАдрес.сч_док,"ЧЦ=3; ЧН=0; ЧГ=")+" х "+ Формат(СтрокаАдрес.сч_скан,"ЧЦ=3; ЧН=0; ЧГ=");
					Элементы.АдресаДоставки.ТекущаяСтрока = СтрокаАдрес.ПолучитьИдентификатор();    
					
					СтруктураФормаРК.Вставить("сч_скан",СтрокаАдрес.сч_скан);
					СтруктураФормаРК.Вставить("сч_док",СтрокаАдрес.сч_док);
					СтруктураФормаРК.Вставить("Global_ID",СтрокаАдрес.ТЧ_Global_ID);  
					СтруктураФормаРК.Вставить("ТД",СтрокаАдрес.ТД); 
					СтруктураФормаРК.Вставить("PKG",СтруктураРК.МассивPKG);  

				КонецЕсли; 
			
			КонецЕсли;
			 	ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеСканированиеРК", ЭтотОбъект);
					ОткрытьФорму("Обработка.Логистика.Форма.ФормаРК",СтруктураФормаРК,ЭтотОбъект,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
				

		Иначе
			Сообщить("Помилка сканування РК "+ RKИнфо.ОписаниеОшибки);	
		КонецЕсли;
	
	Иначе  
		 Сообщить("Відскануйте ролл-кейдж для прив'язки PKG");
	//	
	//	МСтроки =  СтрРазделить(ПолученныйШтрихкод,";");   
	//	Если МСтроки.Количество() = 3  Тогда
	//		ИД_ПКГ = МСтроки[0];
	//		ПКГИнфо = ПолучитьДанныеПКГ(ИД_ПКГ); 
	//		Если ПКГИнфо.Результат Тогда   
	//			ПарамПКГ = ПКГИнфо.Ответ;
	//		
	//			СтрокиАдресаДоставки = Объект.АдресаДоставки.НайтиСтроки(Новый Структура("ТЧ_Global_ID",ПарамПКГ.Global_ID));	
	//			Если СтрокиАдресаДоставки.Количество() = 0  Тогда
	//				Сообщить("У списку немає адреси доставки");	
	//				Возврат;
	//			Иначе
	//				СтрокаАдрес = СтрокиАдресаДоставки[0];
	//				Если СтрокаАдрес.РК Тогда  
	//					 Сообщить("Відскануйте рол кейдж для прив'язки PKG");	
	//					Возврат;
	//				КонецЕсли;
	//				Рез = РазместитьПКГ(ИД_ПКГ);
	//				Если Рез.Результат Тогда 
	//					СтрокаАдрес.сч_скан = СтрокаАдрес.сч_скан + 1;
	//					СтрокаАдрес.ЗаписьПоСтроке = ?(СтрокаАдрес.РК,"ROLL CAGE ","")+"PKG "+ Формат(СтрокаАдрес.сч_док,"ЧЦ=3; ЧН=0; ЧГ=")+" х "+ Формат(СтрокаАдрес.сч_скан,"ЧЦ=3; ЧН=0; ЧГ=");

	//				Иначе
	//					Если не ПустаяСтрока(Рез.ОписаниеОшибки) Тогда
	//						Сообщить(Рез.ОписаниеОшибки);	
	//					Иначе
	//						Сообщить("Помилка сканування PKG");
	//					КонецЕсли;
	//				КонецЕсли;
	//			КонецЕсли;
	//		Иначе  
	//			Сообщить("Помилка сканування PKG "+ ПКГИнфо.ОписаниеОшибки);
	//		КонецЕсли;
	//	КонецЕсли;
	//	
                           
	КонецЕсли;	
	
КонецПроцедуры 


 &НаКлиенте
Процедура ОповещениеСканированиеРК(Результат, Параметры)Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	    
	СтрокиАдресаДоставки = Объект.АдресаДоставки.НайтиСтроки(Новый Структура("ТЧ_Global_ID",Результат.Global_ID)); 
	Если СтрокиАдресаДоставки.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаАдрес = СтрокиАдресаДоставки[0];      
	СтрокаАдрес.сч_скан = Результат.сч_скан;
	СтрокаАдрес.ЗаписьПоСтроке = ?(СтрокаАдрес.РК,"ROLL CAGE ","")+"PKG "+ Формат(СтрокаАдрес.сч_док,"ЧЦ=3; ЧН=0; ЧГ=")+" х "+ Формат(СтрокаАдрес.сч_скан,"ЧЦ=3; ЧН=0; ЧГ=");
	Для Каждого СтрПКГ Из Результат.PKG Цикл 
		СтрокиДок = Объект.Документы.НайтиСтроки(Новый Структура("ИД_УП",СтрПКГ.ИД_PKG)); 
		Если СтрокиДок.Количество()=1 Тогда
			СтрокаДок = СтрокиДок[0];
			СтрокаДок.сч_скан = 1;
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры



&НаКлиенте
Процедура Сканировать(Команда)
	
	ИдетПроцессСканирования = Истина;
	ОткрытьДиалогСканирования();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДиалогСканирования()
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	ДополнительныеПараметры.Вставить("ПотоковоеСканирование");
	ДополнительныеПараметры.Вставить("ЗаголовокСканирования", НСтр("ru = 'Считайте штрих-код'"));
	ДополнительныеПараметры.Вставить("ИмяОбработчикаЗакрытияСканирования", "ОбработкаЗакрытияСканирования");
	
	ПодключаемоеОборудованиеКлиент.ПолучитьШтрихкод(ДополнительныеПараметры);
	
КонецПроцедуры

 &НаКлиенте
Процедура СообщениеИнициализацииПользователяНажатие(Элемент)
	ДополнительныеПараметры = Новый Структура;
	ДопПарметрыФормы = Новый Структура;
	опЗакрытие = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияВводаСотрудника",ЭтотОбъект,ДополнительныеПараметры);
	ОткрытьФорму("Обработка.Сервис.Форма.ИнициализацияСотрудник",ДопПарметрыФормы, ЭтотОбъект,,,,опЗакрытие, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры 

&НаКлиенте
Процедура АктивироватьСканер(Команда)
	
	ИнициализироватьАсинхронныйСканер();
	
КонецПроцедуры 

 &НаКлиенте
Процедура ИнициализироватьАсинхронныйСканер()
	
	ПодключаемоеОборудованиеКлиент.ИнициализироватьАсинхронныйСканер(ЭтаФорма);
	
КонецПроцедуры 





///////
//////
&НаСервере
Процедура ПолучитьДанныеСортировки()

 текстЗапроса = "/Logistika/"+ПараметрыСеанса.UUID+"/TTNInfsort?uuidcom="+ПараметрыСеанса.Сотрудник_ID;

  РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса);
  Объект.АдресаДоставки.Очистить();
  Объект.Документы.Очистить();  
  
  Если РезОтвет.Результат Тогда
	  
	  Если ТипЗнч(РезОтвет.Ответ) = Тип("Структура") Тогда
		  МассивАдреса = РезОтвет.Ответ.ТЧ_РК; 
		  МассивПКГ =   РезОтвет.Ответ.ТЧ_РК_ПКГ;
	  Иначе   
		  МассивАдреса = РезОтвет.Ответ;
		  МассивПКГ = Новый Массив;
	  КонецЕсли;
	  
	  
	 Для Каждого АдресДоставки Из МассивАдреса Цикл 
	   НстрокаАдрес =  Объект.АдресаДоставки.Добавить();  
	   ЗаполнитьЗначенияСвойств(НстрокаАдрес,АдресДоставки);
	   НстрокаАдрес.ЗаписьПоСтроке = ?(НстрокаАдрес.РК,"ROLL CAGE ","")+"PKG "+ Формат(НстрокаАдрес.сч_док,"ЧЦ=3; ЧН=0; ЧГ=")+" х "+ Формат(НстрокаАдрес.сч_скан,"ЧЦ=3; ЧН=0; ЧГ=")
	 КонецЦикла;
	 
	 Для Каждого ПКГДоставки Из МассивПКГ Цикл 
		   НстрокаПКГ =  Объект.Документы.Добавить();   
		   НстрокаПКГ.ТЧ_Global_ID = ПКГДоставки.ТЧ_Global_ID;
		   НстрокаПКГ.СкладСборки  = ПКГДоставки.СкладСборки; 
		   НстрокаПКГ.ИД_УП        = ПКГДоставки.ИД_УП;
		   НстрокаПКГ.НомерТУ  = ПКГДоставки.ПКГНомер;
		   НстрокаПКГ.сч_скан  = ПКГДоставки.сч_скан;
	 КонецЦикла;

	  
  Иначе
	 тОш =  ?(ЗначениеЗаполнено(РезОтвет.ОписаниеОшибки),РезОтвет.ОписаниеОшибки,"Помилка отримання даних"); 
	 Сообщить(тОш);    
	 ОбщегоНазначенияКлиентСервер.ОчиститьСотрудника();
	 ОбновитьСотрудника();
  КонецЕсли;
  

КонецПроцедуры

 &НаСервере
Функция ПолучитьДанныеRK(ШК_RK)

	МассивRK = СтрРазделить(ШК_RK,";",);	 
	ТЕUUID = МассивRK[1]; 
	текстЗапроса = "/Logistika/"+ПараметрыСеанса.UUID+"/RKinf?uuidcom="+ПараметрыСеанса.Сотрудник_ID+"&chk="+ТЕUUID;
	
	РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса);

	Возврат РезОтвет; 
	
КонецФункции

 &НаСервере
Функция ПолучитьДанныеПКГ(ШК_ПКГ)

 
	текстЗапроса = "/Logistika/"+ПараметрыСеанса.UUID+"/PKGinf?uuidcom="+ПараметрыСеанса.Сотрудник_ID+"&chk="+ШК_ПКГ;
	
	РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса);
	
	Возврат РезОтвет; 
	
КонецФункции

 &НаСервере
Функция РазместитьПКГ(ШК_ПКГ)

 
	текстЗапроса = "/Logistika/"+ПараметрыСеанса.UUID+"/PKGLoad?uuidcom="+ПараметрыСеанса.Сотрудник_ID+"&chk="+ШК_ПКГ;
	
	РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса);
	
	Возврат РезОтвет; 
	
КонецФункции
